OdDAI.Model.getIsLoading
\details
Retrieves if a model is in loading from file state.
\returns Returns true if Model is in the process of file loading.

OdDAI.Model.PromoteModelToReadWrite
\details
Function shall change the access mode of the specified SDAI-model from readonly to read-write.

OdDAI.Model.closeModel
\details
Function shall end access to the specified SDAI-model.
\details
Function shall end access to the specified SDAI-model.

OdDAI.Model.mode
\details
Get access mode for an SDAI-model
\returns Returns current access mode.

OdDAI.Model.unloadEntityExtent(OdSmartPtr&lt;OdDAI.Entity&gt;)
\details
Unload application instances by type
\param entityDef [in] An entity.
\returns Returns true if objects were unloaded successfully, and false in other case.

OdDAI.Model.unloadEntityExtent(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
** \details
** \details
\details
Unload application instances by type name
\param entityName [in] An entity's name.
\returns Returns true if objects were unloaded successfully, and false in other case.

OdDAI.Model.getEntityExtent(OdSmartPtr&lt;OdDAI.Entity&gt;)
\details
Retrieves the collection of entity instances with entity type which is kind of entityName.
\param entityName [in] An entity's name.
\returns Returns a smart pointer to entity extent that keeps the collection of entity instances.
\details
Retrieves the collection of entity instances with entity type which is subtype of entityDef.
\param entityDef [in] An smart pointer to entity definition.
\returns Returns a smart pointer to entity extent that keeps the collection of entity instances.

OdDAI.Model.newIterator
\details
Creates an iterator to get sequential access to all entities of the model.
\returns Returns a smart pointer to the model's instance iterator.

OdDAI.Model.insertEntityInstance(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;,OdDbHandle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inserts a newly created entity instance to the model.
\param pInstanceToInsert [in] A smart pointer to the entity instance to be inserted.
\param insertHandle      [in] A handle of the parent object where to insert the entity instance.
\returns Returns an identifier of the inserted entity instance.
\remarks
If the entity being inserted already belongs to another model or it has been already appended or inserted before, the method returns a NULL object identifier.
If the specified database handle already exists in the model, the entity defined with this handle gets a new handle value
and the inserted entity (specified with the pInstanceToInsert parameter) takes the passed handle value (the insertHandle parameter value).

OdDAI.Model.createEntityInstance(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new instance of a specified entity type.
\param entityTypeName [in] A string that contains the type name of the new entity to be created.
\returns Returns a smart pointer to the created entity instance.
\remarks
If the current schema does not support the specified type, the method returns a NULL smart pointer.
In this case the isNull() method of the smart pointer object returns true.
The created entity is not attached to the model.

OdDAI.Model.createEntityInstance(OdSmartPtr&lt;OdDAI.Entity&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new instance of a specified entity type.
\param entityDef [in] entity definition that contains the type name of the new entity to be created.
\returns Returns a smart pointer to the created entity instance.
\remarks
If the current schema does not support the specified type, the method returns a NULL smart pointer.
In this case the isNull() method of the smart pointer object returns true.
The created entity is not attached to the model.

OdDAI.Model.underlyingSchemaName
\details
Retrieves the name of the model's underlying schema.
\returns Returns the name of the model's underlying schema.

OdDAI.Model.underlyingSchema
\details
Retrieves the underlying schema definition of the model.
\returns Returns a smart pointer to the model's underlying schema definition.

OdDAI.Model.getEntityDefinition(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves an entity definition by its name.
\param entityName [in] The name of an entity definition.
\returns Returns a raw pointer to the entity definition.
\remarks
If there is no entity definition with the specified name, the method returns a NULL pointer.

OdDAI.Model.RenameModel(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Function shall assign a new name to the specified SDAI-model.
\param modelName [in] new name of SDAI-model.

OdDAI.Model.initialize(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdSmartPtr&lt;OdDAI.Schema&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.Repository*)
\details
Initializes the model object and creates a minimal model hierarchy based on a schema with the specified name.
\param ifcSchema [in] A string that contains the schema's name.
\param pFiler    [in] A smart pointer to an IFC filer object that is created during the initialization operation.

OdDAI.Model.initialize(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.Repository*)
\details
Initializes the model object and creates a minimal model hierarchy based on a schema with the specified name.
\param ifcSchema [in] A string that contains the schema's name.